# yolov8_swin.yaml
nc: 10  # 클래스 개수
scales:
  n: [1.0, 1.0, 1024]

# Swin Backbone 더미(Dummy) 레이어 (파이썬 코드에서 실제 뇌로 교체됨)
backbone:
  - [-1, 1, Conv, [192, 3, 2]]  # 0: Swin P3 (특징맵 1)
  - [-1, 1, Conv, [384, 3, 2]]  # 1: Swin P4 (특징맵 2)
  - [-1, 1, Conv, [768, 3, 2]]  # 2: Swin P5 (특징맵 3)

# YOLOv8 Neck & Head (Swin의 특징맵과 완벽 호환되도록 채널 폭 수정)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 3
  - [[-1, 1], 1, Concat, [1]] # 4: cat P4
  - [-1, 3, C2f, [384]] # 5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6
  - [[-1, 0], 1, Concat, [1]] # 7: cat P3
  - [-1, 3, C2f, [192]] # 8 (P3 머리)

  - [-1, 1, Conv, [192, 3, 2]] # 9
  - [[-1, 5], 1, Concat, [1]] # 10
  - [-1, 3, C2f, [384]] # 11 (P4 머리)

  - [-1, 1, Conv, [384, 3, 2]] # 12
  - [[-1, 2], 1, Concat, [1]] # 13
  - [-1, 3, C2f, [768]] # 14 (P5 머리)

  - [[8, 11, 14], 1, Detect, [nc]]  # 15: 최종 탐지 (P3, P4, P5)
